package airline;

public class Main {
    public static void main(String[] args) {
        Бронирования система = new Бронирования();

        Рейс р1 = new Рейс("AB123", "Алматы", "Астана", 2);
        Рейс р2 = new Рейс("CD456", "Астана", "Лондон", 3);

        система.добавитьРейс(р1);
        система.добавитьРейс(р2);

        Пассажир п1 = new Пассажир("1", "Ардана", "KZ12345", 120);
        Пассажир п2 = new Пассажир("2", "Ерсұлтан", "KZ54321", 80);
        Пассажир п3 = new Пассажир("3", "Алина", "KZ67890", 200);

        система.забронировать(п1, "AB123");
        система.забронировать(п2, "AB123");
        система.забронировать(п3, "CD456");
        система.забронировать(п3, "AB123");

        System.out.println();
        система.показатьПассажиров("AB123");
        System.out.println();
        система.топПассажиров();
    }
}
